<template>
  <v-row>
    <v-col class="display-destop" sm="6">
      <v-img src="/us.png"></v-img>
    </v-col>
    <v-col sm="6">
      <v-card elevation="0">
        <v-card-title>PRIVACY POLICY</v-card-title>
        <v-card-text style="text-align: justify">
          <h3>
            Privacy Policy (ความคุ้มครองในข้อมูลส่วนตัว) การเข้าเยี่ยมชมเว็บไซต์
            และเนื้อหา ท่านสามารถเข้าชมเว็บไซต์ของเรา เพื่อรับชมผลงาน
            และบริการต่างๆ
            และสืบค้นข้อมูลเบื้องต้นที่เกี่ยวกับเราโดยไม่ต้องแจ้งข้อมูลของท่านให้เราทราบได้
            เราอาจใช้ Software หรือกระบวนการบางอย่าง เพื่อเก็บข้อมูลการเยี่ยมชม
            การใช้บริการของท่าน
            ทั้งนี้เพื่อวัตถุประสงค์ในการปรับปรุงเว็บไซต์ให้ดียิ่งขึ้น เราอาจใช้
            Cookie (คุกกี้) ในการตรวจสอบข้อมูลของท่าน
            และการตั้งค่าการใช้งานระบบของเรา (เช่น การแสดงผลของหน้ารับชมผลงาน)
            การรวบรวมและสงวนข้อมูลส่วนบุคคล ข้อมูลที่เกี่ยวข้องกับของสมาชิก
            จะถูกนำไปใช้เพื่อวัตถุประสงค์ในการพัฒนาการให้บริการที่ดียิ่งขึ้น
            และเราจะเก็บข้อมูลดังกล่าวผ่านแบบฟอร์มที่ท่านเป็นผู้กรอกโดยตรง
            หรือข้อมูลการเข้าใช้ระบบ (Log System) เท่านั้น
            โดยเราจะเก็บรักษาข้อมูลเหล่านั้นไว้เป็นความลับระดับ High
            Confidential และจะไม่มีการเผยแพร่ข้อมูลโดยเด็ดขาด
            เราอาจส่งอีเมล์ถึงสมาชิกเพื่ออัพเดทผลงานใหม่ๆ
            และเสนอการให้บริการอื่นๆ ในอนาคต
          </h3>
        </v-card-text>
      </v-card>
    </v-col>
  </v-row>
</template>

<script>
export default {
  // head() {
  //   return this.$headUtil({
  //     title: 'นโยบายความเป็นส่วนตัว ',
  //     description:
  //       'Privacy Policy (ความคุ้มครองในข้อมูลส่วนตัว) การเข้าเยี่ยมชมเว็บไซต์ และเนื้อหา ท่านสามารถเข้าชมเว็บไซต์ของเรา เพื่อรับชมผลงาน และบริการต่างๆ และสืบค้นข้อมูลเบื้องต้นที่เกี่ยวกับเราโดยไม่ต้องแจ้งข้อมูลของท่านให้เราทราบได้ เราอาจใช้ Software หรือกระบวนการบางอย่าง เพื่อเก็บข้อมูลการเยี่ยมชม การใช้บริการของท่าน ทั้งนี้เพื่อวัตถุประสงค์ในการปรับปรุงเว็บไซต์ให้ดียิ่งขึ้น เราอาจใช้ Cookie (คุกกี้) ในการตรวจสอบข้อมูลของท่าน และการตั้งค่าการใช้งานระบบของเรา (เช่น การแสดงผลของหน้ารับชมผลงาน) การรวบรวมและสงวนข้อมูลส่วนบุคคล ข้อมูลที่เกี่ยวข้องกับของสมาชิก จะถูกนำไปใช้เพื่อวัตถุประสงค์ในการพัฒนาการให้บริการที่ดียิ่งขึ้น และเราจะเก็บข้อมูลดังกล่าวผ่านแบบฟอร์มที่ท่านเป็นผู้กรอกโดยตรง หรือข้อมูลการเข้าใช้ระบบ (Log System) เท่านั้น โดยเราจะเก็บรักษาข้อมูลเหล่านั้นไว้เป็นความลับระดับ High Confidential และจะไม่มีการเผยแพร่ข้อมูลโดยเด็ดขาด เราอาจส่งอีเมล์ถึงสมาชิกเพื่ออัพเดทผลงานใหม่ๆ และเสนอการให้บริการอื่นๆ ในอนาคต',
  //     image: '/icon.png',
  //     urlPath: this.$route.fullPath,
  //   })
  // },
  head() {
    return {
      title: `นโยบายความเป็นส่วนตัว `,
      meta: [
        { charset: 'utf-8' },
        {
          hid: 'viewport',
          name: 'viewport',
          content: 'width=device-width, initial-scale=1',
        },
        {
          hid: 'twitter:card',
          name: 'twitter:card',
          content: 'read cartoon ',
        },
        { hid: 'twitter:site', name: 'twitter:site', content: '@7toons' },
        { hid: 'twitter:creator', name: 'twitter:creator', content: '@7toons' },
        {
          hid: 'twitter:title',
          name: 'twitter:title',
          content: `นโยบายความเป็นส่วนตัว `,
        },
        {
          hid: 'twitter:description',
          name: 'twitter:description',
          content:
            'Privacy Policy (ความคุ้มครองในข้อมูลส่วนตัว) การเข้าเยี่ยมชมเว็บไซต์ และเนื้อหา ท่านสามารถเข้าชมเว็บไซต์ของเรา เพื่อรับชมผลงาน และบริการต่างๆ และสืบค้นข้อมูลเบื้องต้นที่เกี่ยวกับเราโดยไม่ต้องแจ้งข้อมูลของท่านให้เราทราบได้ เราอาจใช้ Software หรือกระบวนการบางอย่าง เพื่อเก็บข้อมูลการเยี่ยมชม การใช้บริการของท่าน ทั้งนี้เพื่อวัตถุประสงค์ในการปรับปรุงเว็บไซต์ให้ดียิ่งขึ้น เราอาจใช้ Cookie (คุกกี้) ในการตรวจสอบข้อมูลของท่าน และการตั้งค่าการใช้งานระบบของเรา (เช่น การแสดงผลของหน้ารับชมผลงาน) การรวบรวมและสงวนข้อมูลส่วนบุคคล ข้อมูลที่เกี่ยวข้องกับของสมาชิก จะถูกนำไปใช้เพื่อวัตถุประสงค์ในการพัฒนาการให้บริการที่ดียิ่งขึ้น และเราจะเก็บข้อมูลดังกล่าวผ่านแบบฟอร์มที่ท่านเป็นผู้กรอกโดยตรง หรือข้อมูลการเข้าใช้ระบบ (Log System) เท่านั้น โดยเราจะเก็บรักษาข้อมูลเหล่านั้นไว้เป็นความลับระดับ High Confidential และจะไม่มีการเผยแพร่ข้อมูลโดยเด็ดขาด เราอาจส่งอีเมล์ถึงสมาชิกเพื่ออัพเดทผลงานใหม่ๆ และเสนอการให้บริการอื่นๆ ในอนาคต',
        },
        {
          hid: 'twitter:image',
          name: 'twitter:image',
          content: `/icon.png`,
        },
        {
          hid: 'description',
          name: 'description',
          content:
            'Privacy Policy (ความคุ้มครองในข้อมูลส่วนตัว) การเข้าเยี่ยมชมเว็บไซต์ และเนื้อหา ท่านสามารถเข้าชมเว็บไซต์ของเรา เพื่อรับชมผลงาน และบริการต่างๆ และสืบค้นข้อมูลเบื้องต้นที่เกี่ยวกับเราโดยไม่ต้องแจ้งข้อมูลของท่านให้เราทราบได้ เราอาจใช้ Software หรือกระบวนการบางอย่าง เพื่อเก็บข้อมูลการเยี่ยมชม การใช้บริการของท่าน ทั้งนี้เพื่อวัตถุประสงค์ในการปรับปรุงเว็บไซต์ให้ดียิ่งขึ้น เราอาจใช้ Cookie (คุกกี้) ในการตรวจสอบข้อมูลของท่าน และการตั้งค่าการใช้งานระบบของเรา (เช่น การแสดงผลของหน้ารับชมผลงาน) การรวบรวมและสงวนข้อมูลส่วนบุคคล ข้อมูลที่เกี่ยวข้องกับของสมาชิก จะถูกนำไปใช้เพื่อวัตถุประสงค์ในการพัฒนาการให้บริการที่ดียิ่งขึ้น และเราจะเก็บข้อมูลดังกล่าวผ่านแบบฟอร์มที่ท่านเป็นผู้กรอกโดยตรง หรือข้อมูลการเข้าใช้ระบบ (Log System) เท่านั้น โดยเราจะเก็บรักษาข้อมูลเหล่านั้นไว้เป็นความลับระดับ High Confidential และจะไม่มีการเผยแพร่ข้อมูลโดยเด็ดขาด เราอาจส่งอีเมล์ถึงสมาชิกเพื่ออัพเดทผลงานใหม่ๆ และเสนอการให้บริการอื่นๆ ในอนาคต',
        },
        {
          hid: 'og:image',
          property: 'og:image',
          content: `/icon.png`,
        },
        {
          hid: 'og:site_name',
          name: 'og:site_name',
          content: `นโยบายความเป็นส่วนตัว `,
        },
        {
          hid: 'og:title',
          name: 'og:title',
          content: `นโยบายความเป็นส่วนตัว `,
        },
        {
          hid: 'og:description',
          name: 'og:description',
          content:
            'Privacy Policy (ความคุ้มครองในข้อมูลส่วนตัว) การเข้าเยี่ยมชมเว็บไซต์ และเนื้อหา ท่านสามารถเข้าชมเว็บไซต์ของเรา เพื่อรับชมผลงาน และบริการต่างๆ และสืบค้นข้อมูลเบื้องต้นที่เกี่ยวกับเราโดยไม่ต้องแจ้งข้อมูลของท่านให้เราทราบได้ เราอาจใช้ Software หรือกระบวนการบางอย่าง เพื่อเก็บข้อมูลการเยี่ยมชม การใช้บริการของท่าน ทั้งนี้เพื่อวัตถุประสงค์ในการปรับปรุงเว็บไซต์ให้ดียิ่งขึ้น เราอาจใช้ Cookie (คุกกี้) ในการตรวจสอบข้อมูลของท่าน และการตั้งค่าการใช้งานระบบของเรา (เช่น การแสดงผลของหน้ารับชมผลงาน) การรวบรวมและสงวนข้อมูลส่วนบุคคล ข้อมูลที่เกี่ยวข้องกับของสมาชิก จะถูกนำไปใช้เพื่อวัตถุประสงค์ในการพัฒนาการให้บริการที่ดียิ่งขึ้น และเราจะเก็บข้อมูลดังกล่าวผ่านแบบฟอร์มที่ท่านเป็นผู้กรอกโดยตรง หรือข้อมูลการเข้าใช้ระบบ (Log System) เท่านั้น โดยเราจะเก็บรักษาข้อมูลเหล่านั้นไว้เป็นความลับระดับ High Confidential และจะไม่มีการเผยแพร่ข้อมูลโดยเด็ดขาด เราอาจส่งอีเมล์ถึงสมาชิกเพื่ออัพเดทผลงานใหม่ๆ และเสนอการให้บริการอื่นๆ ในอนาคต',
        },
      ],
    }
  },
}
</script>

<style></style>
